ednieuw/Arduino-ESP32-Nano-Wordclock/ESP32_WordClockV122/ESP32_WordClockV122.ino
//--------------------------------------------                                                //
// WIFI WEBPAGE 
//--------------------------------------------
void WebPage(void)
{
 int i = 0, n;
 static bool updateSuccess = false;                                                          // Track update status
 SWversion();
 for (n = 0; n < strlen(index_html_top); n++) HTML_page[i++] = index_html_top[n];
 if (i > MAXSIZE_HTML_PAGE - 999) 
    { strcat(HTML_page, "<br> *** INCREASE MAXSIZE_HTML_PAGE in Webpage.h ***<br><br><br>"); } 
 else 
    {
     sprintf(sptext, "<head><title>%s</title></head>",Mem.BLEbroadcastName);
     for (n = 0; n < strlen(sptext); n++)            HTML_page[i++] = sptext[n];
     for (n = 0; n < strlen(html_info); n++)         HTML_page[i++] = html_info[n];
     for (n = 0; n < strlen(index_html_footer); n++) HTML_page[i++] = index_html_footer[n];
     HTML_page[i] = 0;
    }
 
 server.on("/", HTTP_GET, []() { server.send(200, "text/html", HTML_page);  });
 server.on("/get", HTTP_GET, []()
   {
    String inputMessage;
    if (server.hasArg(PARAM_INPUT_1)) { inputMessage = server.arg(PARAM_INPUT_1); } 
    else { inputMessage = ""; }
    if (!inputMessage.equalsIgnoreCase("Y") ) ReworkInputString(inputMessage);
    if (inputMessage.equalsIgnoreCase("Y") ) OptionYRainbow = true;
    SWversion();
    int i = 0, n;
    for (n = 0; n < strlen(index_html_top); n++)    HTML_page[i++] = index_html_top[n];
    for (n = 0; n < strlen(html_info); n++)         HTML_page[i++] = html_info[n];
    for (n = 0; n < strlen(index_html_footer); n++) HTML_page[i++] = index_html_footer[n];
    HTML_page[i] = 0;
    server.send(200, "text/html", HTML_page);
    });

 server.on("/update", HTTP_GET, []() { server.send(200, "text/html", OTA_html); });
 server.on("/update", HTTP_POST, 
    [](){                                                                                     // Response handler - called after upload completes
         if (updateSuccess) {
           server.send(200, "text/html",
            "<!DOCTYPE html><html><body>"
            "<h2>Update successful. Rebooting...</h2>"
            "<p>Device will restart in 10 seconds.</p>"
            "<script>setTimeout(()=>{location.href='/'}, 12000);</script>"
            "</body></html>");
           delay(3000);  // Let response send
           shouldReboot = true;
         } else {
           server.send(500, "text/html",
            "<!DOCTYPE html><html><body>"
            "<h2>Update Failed!</h2>"
            "<p>Please try again or check serial output for errors.</p>"
            "<script>setTimeout(()=>{location.href='/update'}, 5000);</script>"
            "</body></html>");
         }
    }, 
    [](){ // Upload handler
      HTTPUpload& upload = server.upload();
      
      if (upload.status == UPLOAD_FILE_START) 
        {
         updateSuccess = false;
         Serial.printf("\n=== OTA Update Started ===\n");
         Serial.printf("Filename: %s\n", upload.filename.c_str());
         Serial.printf("Free Sketch Space: %u bytes\n", ESP.getFreeSketchSpace());
         
         // Validate filename
         if (!upload.filename.endsWith(".bin")) {
           Serial.println("ERROR: Invalid file type. Must be .bin");
           Update.abort();
           return;
         }
         
         // Begin update with maximum available size
         uint32_t maxSketchSpace = (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
         if (!Update.begin(maxSketchSpace)) {
           Serial.println("ERROR: Not enough space for OTA update");
           Update.printError(Serial);
           return;
         }
         
         Serial.println("Update begin successful");
        } 
      else if (upload.status == UPLOAD_FILE_WRITE) 
        {
         // Write firmware chunk
         size_t written = Update.write(upload.buf, upload.currentSize);
         if (written != upload.currentSize) {
           Serial.printf("ERROR: Write failed - written %u != %u bytes\n", 
                        written, upload.currentSize);
           Update.printError(Serial);
           Update.abort();
           return;
         }
         
         // Progress feedback (optional - remove if it causes issues)
         static uint32_t lastPrint = 0;
         if (millis() - lastPrint > 1000) {
           Serial.printf("Progress: %u bytes\n", upload.totalSize + upload.currentSize);
           lastPrint = millis();
         }
        } 
      else if (upload.status == UPLOAD_FILE_END) 
        {
         // Finalize update with MD5 verification
         if (Update.end(true)) {
           Serial.printf("\n=== OTA Update Successful ===\n");
           Serial.printf("Total size: %u bytes\n", upload.totalSize);
           
           // Verify MD5 if available
           if (Update.hasError()) {
             Serial.println("WARNING: Update completed but has errors");
             Update.printError(Serial);
             updateSuccess = false;
           } else {
             Serial.println("Firmware verification passed");
             updateSuccess = true;
           }
         } else {
           Serial.println("\n=== OTA Update Failed ===");
           Serial.printf("Bytes received: %u\n", upload.totalSize);
           Update.printError(Serial);
           updateSuccess = false;
         }
        } 
      else if (upload.status == UPLOAD_FILE_ABORTED) 
        {
         Update.end();
         Serial.println("\n=== OTA Update Aborted ===");
         updateSuccess = false;
        }
    });

 server.onNotFound([]() {  server.send(404, "text/plain", "Not found");  });
 server.begin();
}
//--------------------------------------------                                                //
// WIFI WEBPAGE Login credentials Access Point page with 192.168.4.1
//--------------------------------------------
void StartAPMode(void) 
{
 WiFi.disconnect(true);                                                                      // Disconnect and erase old config
 apMode = true;
 Mem.WIFIcredentials = IN_AP_NOT_SET;
 StoreStructInFlashMemory();
 WiFi.softAP(AP_SSID, AP_PASSWORD);
 delay(100);
 xTaskCreatePinnedToCore(WebServerTask,"WebServerTask", 4096, NULL, 1, NULL, 1 );            // Start handleClient loop on core 1
 dnsServer.start(53, "*", WiFi.softAPIP());
 Tekstprintln("\nConnect to StartWordcock in WIFI on your mobile.\nEnter password: wordclock\nThen in URL: 192.168.4.1 and enter router credentials");   
 server.on("/", HTTP_GET, []() {  server.send(200, "text/html", SoftAP_html); });            // Serve AP HTML form
 server.on("/", HTTP_POST, []()                                                              // Handle AP form POST
  {
    int params = server.args();
    for (int i = 0; i < params; i++) 
    {
      String name = server.argName(i);
      String value = server.arg(i);
      if (name == "ssid") strcpy(Mem.SSID, value.c_str());
      if (name == "pass") strcpy(Mem.Password, value.c_str());
    }
    Mem.WIFIcredentials = SET;
    StoreStructInFlashMemory();
    server.send(200, "text/plain", "Credentials saved. Restarting..."); 
    delay(300);
    ESP.restart();
  } );
 server.begin();
 Serial.println("AP Mode Started");
 Serial.print("AP SSID: ");       Serial.println(AP_SSID);
 Serial.print("AP IP Address: "); Serial.println(WiFi.softAPIP()); 
}

//--------------------------------------------                                                //
// WIFI WPS functions
//--------------------------------------------
void wpsInitConfig()
{
 config.wps_type = ESP_WPS_MODE;
 strcpy(config.factory_info.manufacturer, ESP_MANUFACTURER);
 strcpy(config.factory_info.model_number, ESP_MODEL_NUMBER);
 strcpy(config.factory_info.model_name, ESP_MODEL_NAME);
 strcpy(config.factory_info.device_name, ESP_DEVICE_NAME);
}

void wpsStart()
{
 if(esp_wifi_wps_enable(&config))  Serial.println("WPS Enable Failed");
 else if(esp_wifi_wps_start(0)) 	 Serial.println("WPS Start Failed");
}

void wpsStop()
{
 if(esp_wifi_wps_disable()) 	     Serial.println("WPS Disable Failed");
}

String wpspin2string(uint8_t a[])
{
 char wps_pin[9];
 for(int i=0;i<8;i++){ wps_pin[i] = a[i]; }
 wps_pin[8] = '\0';
 return (String)wps_pin;
}
//--------------------------------------------                                                //
// End WPS
//--------------------------------------------

                                  #ifdef ONEWIREKEYPAD3x4
//--------------------------------------------                                                //
// KEYPAD check for Onewire Keypad input
//--------------------------------------------
void OnewireKeypad3x4Check(void)
{
 int keyvalue=99;
 int Key=0;
 int sensorValue = analogRead(OneWirePin); // read the value from the sensor:
 switch(sensorValue)
  {
    case   0 ... 100:  keyvalue = 13; break;   // noise
    case 101 ... 132:  keyvalue = 12; Key = '*'; break;   // * 
    case 133 ... 154:  keyvalue =  0; Key = '0'; break;   // 0 
    case 155 ... 216:  keyvalue = 11; Key = '#'; break;   // # 
    case 217 ... 281:  keyvalue =  7; Key = '7'; break;   // 7 
    case 282 ... 318:  keyvalue =  4; Key = '4'; break;   // 4 
    case 319 ... 349:  keyvalue =  1; Key = '1'; break;   // 1 
    case 350 ... 390:  keyvalue =  8; Key = '8'; break;   // 8 
    case 391 ... 463:  keyvalue =  5; Key = '5'; break;   // 5 
    case 464 ... 519:  keyvalue =  2; Key = '2'; break;   // 2 
    case 520 ... 619:  keyvalue =  9; Key = '9'; break;   // 9 
    case 620 ... 848:  keyvalue =  6; Key = '6'; break;   // 6 
    case 849 ... 1023: keyvalue =  3; Key = '3'; break;   // 3
  }
 if(keyvalue<13) { Serial.println(Key); delay(300); }
  if (Key == 12)   // *                                                                       // Pressing a * activates the keyboard input. 
   {  
    KeyInputactivated = true;
    KeyLooptime = millis();
    KeypadString ="";
    ColorLeds("",0,NUM_LEDS-1,0x00FF00);                                                      // Turn all LEDs green
    ShowLeds();                                                                               // Push data in LED strip to commit the changes
    Serial.println("Key entry activated");
   }
 if (KeyInputactivated && (Key>=0 && Key<10))
   {
    delay(20); 
    KeypadString += Key;                                                                      // Digit keys 0 - 9
    ColorLeds("",0,Key-48,0xFF0000);                                                          // Turn all LEDs red
    ShowLeds();                                                                               // Push data in LED strip to commit the changes
 //   Serial.println(KeypadString);
   }
 if (KeypadString.length()>5)                                                                 // If six numbers are entered rework this to a time hhmmss
   {       
   if(KeypadString=="999999")
     { 
      KeypadString = "";   
      Reset();
      Serial.println("Settings reset");   
     }
    else 
     {      
      ReworkInputString(KeypadString);                                                        // Rework ReworkInputString();
      KeypadString = "";
      Serial.println("Time changed");
     }    
   }
 if ( KeyInputactivated && ((millis() - KeyLooptime) > 30000) ) 
   {  
    KeyInputactivated = false;                                                                // Stop data entry after 30 seconds. This avoids unintended entry 
    KeypadString ="";
    Serial.println("Keyboard entry stopped");
  }
}
                                  #endif  //ONEWIREKEYPAD3x4  
                                  #ifdef ONEWIREKEYPAD3x1
//--------------------------------------------                                                //
// KEYPAD check for Onewire Keypad input with 5V and 1.1, 4.7, 4.7, 4.7 kOhm resistors
//--------------------------------------------
void OnewireKeypad3x1Check(void)
{
 int8_t keyvalue = 99;
 int8_t Key;
 int16_t sensorValue = analogRead(OneWirePin);                                                    // Read the value from the sensor:
 switch(sensorValue)
   {
    case   0 ... 385:  keyvalue = 99;            break;                                       // Noise
    case 386 ... 635:  keyvalue = -1; Key = 'G'; break;                                       // G 
    case 636 ... 910:  keyvalue =  0; Key = 'Y'; break;                                       // Y 
    case 911 ... 1024: keyvalue =  1; Key = 'R'; break;                                       // R 
   }
 if(keyvalue<2) 
    { 
//     Serial.print(sensorValue); Serial.println(Key); 
     if (Key == 'R') ProcessKeyPressTurn(1);                                                  // Pressing Red increases hour or minute. 
     if (Key == 'G') ProcessKeyPressTurn(-1);                                                 // Pressing Green decreases hour or minute. 
     if (Key == 'Y') ProcessKeyPressTurn(0);                                                  // Pressing Yellow activates the keyboard input. 
     delay(200);     
    }
}
                                  #endif //ONEWIREKEYPAD3x1
//--------------------------------------------                                                //
// KEYPAD 3x1 Init 
//--------------------------------------------
 void InitKeypad3x1(void)
 {
 digitalWrite(COLPIN,LOW);
 sprintf(sptext,"3*1 keypad %s used", Mem.UseRotary==2?"IS":"NOT");
 Tekstprintln(sptext);
 }
//--------------------------------------------
// KEYPAD check for Keypad input
//--------------------------------------------                           
void Keypad3x1Check(void)
{ 
// digitalWrite(COLPIN,LOW);                                                                    // Mimic a key press on pin 6 in order to select the first column
 char Key = keypad.getKey();
 if(Key)
  {
   Serial.println(Key);
   if (Key == 'Y')    ProcessKeyPressTurn(0);                                                 // Pressing Middle button Yellow activates the keyboard input.   
   else if (ChangeTime)    
     { 
      if (Key == 'R') ProcessKeyPressTurn(1);                                                 // Pressing Red increases hour or minute. 
      if (Key == 'G') ProcessKeyPressTurn(-1);                                                // Pressing Green decreases hour or minute. 
     }
   delay(200);
  }
} 
//--------------------------------------------                                                //
// KY-040 ROTARY encoder Init 
//--------------------------------------------
 void InitRotaryMod(void)
 {
 pinMode(encoderPinA,  INPUT_PULLUP);
 pinMode(encoderPinB,  INPUT_PULLUP);  
 pinMode(clearButton,  INPUT_PULLUP); 
 myEnc.write(0);                                                                              // Clear Rotary encoder buffer
 sprintf(sptext,"Rotary %s used", Mem.UseRotary==1?"IS":"NOT");
 Tekstprintln(sptext);   
 } 
//--------------------------------------------                                                //
// KY-040 ROTARY check if the rotary is moving
//--------------------------------------------
void RotaryEncoderCheck(void)
{
 int ActionPress = 999;
 if (digitalRead(clearButton) == LOW )          ProcessKeyPressTurn(0);                       // Set the time by pressing rotary button
 else if (ChangeTime || ChangeLightIntensity)    
  {   
   ActionPress = myEnc.read();                                                                // If the knob is turned store the direction (-1 or 1)
   if (ActionPress == 0) {  ActionPress = 999;  ProcessKeyPressTurn(ActionPress);  }          // Sent 999 = nop (no operation) 
   if (ActionPress == 1 || ActionPress == -1 )  ProcessKeyPressTurn(ActionPress);             // Process the ActionPress
  } 
 myEnc.write(0);                                                                              // Set encoder pos back to 0

if ((unsigned long) (millis() - RotaryPressTimer) > 60000)                                    // After 60 sec after shaft is pressed time of light intensity can not be changed 
   {
    if (ChangeTime || ChangeLightIntensity)                         
      {
        Tekstprintln("<-- Changing time is over -->");
        NoofRotaryPressed = 0;
      }
    ChangeTime            = false;
    ChangeLightIntensity  = false;
   }   
}

//--------------------------------------------                                                //
// CLOCK KY-040 Rotary or Membrane 3x1 processing input
// encoderPos < 1 left minus 
// encoderPos = 0 attention and selection choice
// encoderPos > 1 right plus
//--------------------------------------------
void ProcessKeyPressTurn(int encoderPos)
{
 if (ChangeTime || ChangeLightIntensity)                                                      // If shaft is pressed time of light intensity can be changed
   {
    if ( encoderPos!=999 && ( (millis() - Looptime) > 250))                                   // If rotary turned avoid debounce within 0.25 sec
     {   
     Serial.print(F("----> Index:"));   Serial.println(encoderPos);
     if (encoderPos == 1)                                                                     // Increase  
       {     
        if (ChangeLightIntensity)  { WriteLightReducer(5); }                                  // If time < 60 sec then adjust light intensity factor
        if (ChangeTime) 
          {
           if (NoofRotaryPressed == 1)                                                        // Change hours
              {if( ++timeinfo.tm_hour >23) { timeinfo.tm_hour = 0; } }      
           if (NoofRotaryPressed == 2)                                                        // Change minutes
              {  timeinfo.tm_sec = 0;
               if( ++timeinfo.tm_min  >59) 
                 { timeinfo.tm_min  = 0; if( timeinfo.tm_hour >=23) { timeinfo.tm_hour = 0; } }   
              }
           } 
        }    
      if (encoderPos == -1)                                                                   // Decrease
       {
       if (ChangeLightIntensity)   { WriteLightReducer(-5); }                                 // If time < 60 sec then adjust light intensity factor
       if (ChangeTime)     
          {
           if (NoofRotaryPressed == 1)                                                        // Change hours
             {if( timeinfo.tm_hour-- ==0)  { timeinfo.tm_hour = 23; }  }      
           if (NoofRotaryPressed == 2)                                                        // Change minutes
             { 
              timeinfo.tm_sec = 0;
              if( timeinfo.tm_min-- == 0) 
                { timeinfo.tm_min  = 59; if( timeinfo.tm_hour  == 0) { timeinfo.tm_hour = 23; } }
             } 
           }          
        } 
      SetDS3231Time();  
      Displaytime();
      Looptime = millis();    
     }                                                     
   }
 if (encoderPos == 0 )                                                                        // Set the time by pressing rotary button
   { 
    delay(250);
    ChangeTime            = false;
    ChangeLightIntensity  = false;
    RotaryPressTimer      = millis();                                                         // Record the time the shaft was pressed.
    if(++NoofRotaryPressed > 9) NoofRotaryPressed = 0;
    switch (NoofRotaryPressed)                                                                // No of times the rotary is pressed
      {
       case 1:  ChangeTime = true;           BlinkUUR(3, 300);      break;                    // Change the hours
       case 2:  ChangeTime = true;           BlinkHETISWAS(3, 300); break;                    // Change the hours        
       case 3:  ChangeLightIntensity = true; BlinkTWAALF(3, 300);   break;                    // Turn on TWAALF and change intensity 
       case 4:                                                      break;                    // 
       case 5:                                                      break;                    // 
       case 6:                                                      break;                    // 
       case 7:                                                      break;                    //                                
       case 8:                                                      break;
       case 9:  Reset();                                            break;                    // Reset all settings                                                                  
      default:                                                      break;                     
      }
    Serial.print(F("NoofRotaryPressed: "));   Serial.println(NoofRotaryPressed);   
    Looptime = millis();     
    Displaytime();                                                                            // Turn on the LEDs with proper time
   }
 }

//--------------------------------------------                                                //
// IR-RECEIVER Init
//--------------------------------------------
void Init_IRreceiver(void)
{
 IrReceiver.begin(IRReceiverPin);
 NOOFBUTTONS = sizeof(ButtonNames) / sizeof(ButtonNames[0]); 
 if (Mem.UseRotary == 3)  {  GetIRRemoteFromFlashMemory(); }                                  // Load IR settings (only if IR remote is enabled)
 if (IRMem.remoteIdentified && IRMem.buttons[0].learned)                                      // Check if we already have learned buttons
  {
   learningMode = false;
   PrintAllMappings();
  }
}
//--------------------------------------------                                                //
// IR-RECEIVER Decode received signal,
// routes to learning or recognition mode and return code
//--------------------------------------------
uint16_t IrReceiverDecode(void)
{
  uint16_t command = 0; 
  if (IrReceiver.decode())
  {
                   command = IrReceiver.decodedIRData.command;
    uint16_t address       = IrReceiver.decodedIRData.address;
    decode_type_t protocol = IrReceiver.decodedIRData.protocol;
    if (!(IrReceiver.decodedIRData.flags & IRDATA_FLAGS_IS_REPEAT))                           // Ignore repeat codes
    {
      if (learningMode)  { ProcessLearningMode(protocol, command, address);  }
      else               { ProcessRecognitionMode(protocol, command, address);  }
    }
    delay(100);
    IrReceiver.resume();
  }
  return command;
}

//============================================
// IR-RECEIVER Internal function - Handles learning mode
// Validates remote matches, Saves when complete
//============================================
void ProcessLearningMode(decode_type_t protocol, uint16_t command, uint16_t address)
{
  // First button press - identify the remote control
  if (!IRMem.remoteIdentified)
  {
    IRMem.learnedRemoteAddress = address;
    IRMem.learnedRemoteProtocol = (uint8_t)protocol;
    IRMem.remoteIdentified = true;
    sprintf(sptext, "Remote identified - Protocol: %s, Address: 0x%04X", getProtocolString(protocol), address);
    Tekstprintln(sptext);
  }
  else
  {
    if (address != IRMem.learnedRemoteAddress || protocol != (decode_type_t)IRMem.learnedRemoteProtocol)    // Check if this is from the same remote
    {
      Tekstprintln("⚠ Wrong remote! Please use the same remote control.");
      sprintf(sptext, "Expected Address: 0x%04X, Got: 0x%04X", IRMem.learnedRemoteAddress, address);
      Tekstprintln(sptext);
      return;
    }
  }
  IRMem.buttons[currentLearningIndex].protocol = (uint8_t)protocol;                           // Store the button mapping
  IRMem.buttons[currentLearningIndex].command = command;
  IRMem.buttons[currentLearningIndex].address = address;
  IRMem.buttons[currentLearningIndex].learned = true;
  
